app/views/albums/show.html.erb

  <div class="track-list">
    <%= render @album.tracks.order(:ord) %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1 ORDER BY "tracks"."ord" ASC  [["album_id", 2]]