app/views/bands/show.html.erb

  <div class='show-lists'>
    <%= render @band.albums.order('year DESC, title') %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1 ORDER BY year DESC, title  [["band_id", 4]]