app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" ORDER BY year DESC, title
---
  def index
    @albums = Album.all

INSERT INTO "albums" ("band_id", "title", "year", "is_live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 3], ["title", "wer;j"], ["year", 1232], ["is_live", true], ["created_at", "2018-10-18 19:02:53.375425"], ["updated_at", "2018-10-18 19:02:53.375425"]]
---
  def create
    @album = Album.new(album_params)
    @album.is_live = live_or_studio?(params[:album][:is_live])
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @album = Album.find_by(id: params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @album = Album.find_by(id: params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "albums" SET "is_live" = $1, "year" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["is_live", true], ["year", 2000], ["updated_at", "2018-10-21 20:42:25.443240"], ["id", 5]]
UPDATE "albums" SET "is_live" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["is_live", false], ["updated_at", "2018-10-18 18:56:30.385266"], ["id", 3]]
---
  def update
    album = Album.find_by(id: params[:id])
    if !album
      redirect_to albums_url
    elsif album.update(album_params)
      album.update(is_live: live_or_studio?(params[:album][:is_live]))

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]
---
  def destroy
    album = Album.find_by(id: params[:id])
    band_id = album.band_id
    album.destroy