app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
  def index
    @bands = Band.all

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "chains"], ["created_at", "2018-10-18 18:15:35.701397"], ["updated_at", "2018-10-18 18:15:35.701397"]]
---
  def create
    @band = Band.new(band_params)
    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Beatle"], ["updated_at", "2018-10-18 15:47:46.595894"], ["id", 4]]
---
  def update
    band = Band.find_by(id: params[:id])
    if !band
      redirect_to bands_url
    elsif band.update(band_params)

DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 4]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def destroy
    Band.find_by(id: params[:id]).destroy