app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["track_id", 1], ["body", "hello"]]
---
  def create
    note = Note.new(note_params)
    note.user_id = current_user.id
    if note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @note = Note.find(params[:id])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "notes" SET "body" = $1 WHERE "notes"."id" = $2  [["body", "hello! testing edit!"], ["id", 3]]
---
  def update
    note = Note.find(params[:id])
    if note && note.update(note_params)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 4]]
---
  def destroy
    note = Note.find(params[:id])
    if note && current_user.id == note.user_id
      track_id = note.track_id
      note.destroy