app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
  def index
    @tracks = Track.all

INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "is_bonus", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["album_id", 4], ["title", "woier"], ["ord", 12], ["lyrics", "asdfasd"], ["is_bonus", false], ["created_at", "2018-10-18 19:05:34.101579"], ["updated_at", "2018-10-18 19:05:34.101579"]]
---
  def create
    @track = Track.new(track_params)
    @track.is_bonus = bonus_or_regular?(track_params[:is_bonus])
    if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @track = Track.find_by(id: params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @track = Track.find_by(id: params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "is_bonus" = $1, "lyrics" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4  [["is_bonus", true], ["lyrics", "asdfasd\r\nasdf\r\nqoiwru;lwi"], ["updated_at", "2018-10-18 19:07:37.245490"], ["id", 1]]
UPDATE "tracks" SET "is_bonus" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["is_bonus", false], ["updated_at", "2018-10-18 19:06:57.268164"], ["id", 1]]
---
  def update
    track = Track.find_by(id: params[:id])
    if !track
      redirect_to tracks_url
    elsif track.update(track_params)
      track.update(is_bonus: bonus_or_regular?(track_params[:is_bonus]))

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 6]]
---
  def destroy
    track = Track.find_by(id: params[:id])
    album_id = track.album_id
    track.destroy