app/models/user.rb

  def self.find_by_credentials(params)
    user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "soonmi1"], ["LIMIT", 1]]